app/views/admin/for_sale_items/_form.html.erb

		<%= f.label "Designer" %>
		<%= f.select :designer_id, options_from_collection_for_select(Designer.all, "id", "name"),
			:prompt => "Escolha um designer" %>
---
SELECT `designers`.* FROM `designers` ORDER BY name ASC