app/views/for_sale_items/index.html.erb

	<ul id="artist-works">
	<% @designer.for_sale_items.each do |item| %>
---
SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`designer_id` = 1 ORDER BY year DESC