app/views/for_sale_items/show.html.erb

SELECT `for_sale_item_images`.* FROM `for_sale_item_images` WHERE `for_sale_item_images`.`for_sale_item_id` = 1 ORDER BY position ASC
---
		<% index = 1 %>
		<% @for_sale_item.for_sale_item_images.each do |image| %>