app/controllers/admin/designers_controller.rb

SELECT `designers`.* FROM `designers` ORDER BY name ASC
---
  def index
    @designers = Designer.all

INSERT INTO `designers` (`about`, `behance`, `blogger`, `created_at`, `curriculum`, `email`, `facebook`, `featured`, `image`, `linkedin`, `name`, `pinterest`, `slug`, `surname`, `updated_at`, `vimeo`) VALUES ('', '', '', '2013-10-20 17:40:24', NULL, '', '', 1, NULL, '', 'vitor', '', 'vitor', '', '2013-10-20 17:40:24', '')
---
  def create
    @designer = Designer.create( params[:designer] )

SELECT `designers`.* FROM `designers` WHERE `designers`.`id` = 6 ORDER BY name ASC LIMIT 1
DELETE FROM `designers` WHERE `designers`.`id` = 6
---
  def destroy
    designer = Designer.find( params[:id] )
    designer.delete

SELECT `designers`.* FROM `designers` WHERE `designers`.`id` = 6 ORDER BY name ASC LIMIT 1
---
  def edit
    @designer = Designer.find( params[:id] )

SELECT `designers`.* FROM `designers` WHERE `designers`.`id` = 6 ORDER BY name ASC LIMIT 1
UPDATE `designers` SET `name` = 'vitor', `surname` = '', `about` = '', `email` = '', `behance` = '', `blogger` = '', `facebook` = '', `linkedin` = '', `pinterest` = '', `vimeo` = '', `slug` = 'vitor', `updated_at` = '2013-10-14 18:12:54' WHERE `designers`.`id` = 6
---
  def update
    @designer = Designer.find( params[:id] )
    @designer.update_attributes( params[:designer] )