app/controllers/admin/for_sale_items_controller.rb

  def index
    @for_sale_items = ForSaleItem.all
---
SELECT `for_sale_items`.* FROM `for_sale_items`

  def create
    @for_sale_item = ForSaleItem.create( params[:for_sale_item] )
---
INSERT INTO `for_sale_items` (`cover`, `created_at`, `description`, `designer_id`, `name`, `slug`, `updated_at`) VALUES (NULL, '2013-10-20 05:25:23', NULL, NULL, NULL, NULL, '2013-10-20 05:25:23')

  def edit
    @for_sale_item = ForSaleItem.find( params[:id] )
---
SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 6 LIMIT 1

  def update
    @for_sale_item = ForSaleItem.find( params[:id] )
    @for_sale_item.update_attributes( params[:for_sale_item] )
---
SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 4 LIMIT 1
UPDATE `for_sale_items` SET `name` = 'teste', `description` = '<p>ahuahduahs</p>', `cover` = '3.jpg', `updated_at` = '2013-11-15 05:23:26' WHERE `for_sale_items`.`id` = 4

  def destroy
    for_sale_item = ForSaleItem.find( params[:id] )
    for_sale_item.delete
---
SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 1 LIMIT 1
DELETE FROM `for_sale_items` WHERE `for_sale_items`.`id` = 1