app/controllers/admin/for_sale_item_images_controller.rb

SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 6 LIMIT 1
---
  def index
    ForSaleItemImage.consolidate_positions( params[:for_sale_item_id] || params[:for_sale_item] )
    @for_sale_item = ForSaleItem.find( params[:for_sale_item_id] )

SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 6 LIMIT 1
---
  def new
    @for_sale_item = ForSaleItem.find( params[:for_sale_item_id] )

INSERT INTO `for_sale_item_images` (`created_at`, `for_sale_item_id`, `position`, `updated_at`, `url`) VALUES ('2013-10-20 05:52:02', 6, NULL, '2013-10-20 05:52:02', '3.jpg')
---
  def create
    @for_sale_item_image = ForSaleItemImage.new( params[:for_sale_item_image] )
    @for_sale_item_image.save

SELECT `for_sale_item_images`.* FROM `for_sale_item_images` WHERE (position = 1 and for_sale_item_id = 6) ORDER BY position ASC LIMIT 1
SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 6 LIMIT 1
UPDATE `for_sale_item_images` SET `position` = 0, `updated_at` = '2013-10-20 05:53:28' WHERE `for_sale_item_images`.`id` = 1
---
  def down
    image = ForSaleItemImage.find(params[:id])
    next_images = ForSaleItemImage.where("position = ? and for_sale_item_id = ?", image.position + 1, image.for_sale_item.id).limit(1)
    if next_images and next_images.length > 0
      next_image = next_images[0]
      next_image.position = image.position
      image.position = image.position + 1
      next_image.save
      image.save