app/controllers/admin/job_images_controller.rb

  def create
    @job_image = JobImage.new( params[:job_image] )
    @job_image.save
---
INSERT INTO `job_images` (`created_at`, `job_id`, `position`, `updated_at`, `url`) VALUES ('2013-10-20 05:08:06', 1, NULL, '2013-10-20 05:08:06', '3.jpg')

  def destroy
    job_image = JobImage.find( params[:id] )
    job = job_image.job
    job_image.delete
---
SELECT `job_images`.* FROM `job_images` WHERE `job_images`.`id` = 1 LIMIT 1
DELETE FROM `job_images` WHERE `job_images`.`id` = 1

  def up
    image = JobImage.find(params[:id])
    if image.position > 0
      previous_images = JobImage.where("position = ? and job_id = ?", image.position - 1, image.job.id).limit(1)
      if previous_images and previous_images.length > 0
        previous_image = previous_images[0]
        previous_image.position = image.position
        image.position = image.position - 1
        previous_image.save
---
SELECT `job_images`.* FROM `job_images` WHERE (position = 0 and job_id = 1) ORDER BY position ASC LIMIT 1
UPDATE `job_images` SET `position` = 1, `updated_at` = '2013-10-20 05:12:19' WHERE `job_images`.`id` = 1

  def down
    image = JobImage.find(params[:id])
    next_images = JobImage.where("position = ? and job_id = ?", image.position + 1, image.job.id).limit(1)
    if next_images and next_images.length > 0
      next_image = next_images[0]
      next_image.position = image.position
      image.position = image.position + 1
      next_image.save
---
SELECT `job_images`.* FROM `job_images` WHERE (position = 1 and job_id = 1) ORDER BY position ASC LIMIT 1
UPDATE `job_images` SET `position` = 0, `updated_at` = '2013-10-20 05:12:14' WHERE `job_images`.`id` = 2