app/controllers/admin/main_controller.rb

  def index
    if Main.count == 0
      @main = Main.new
      @main.save
    else
      @main = Main.all[0]
---
SELECT COUNT(*) FROM `mains`
INSERT INTO `mains` (`about`, `created_at`, `email`, `picture`, `updated_at`) VALUES (NULL, '2013-10-14 16:50:16', NULL, NULL, '2013-10-14 16:50:16')
SELECT `mains`.* FROM `mains`

  def update
    @main = Main.find( params[:id] )
    @main.update_attributes( params[:principal] )
---
SELECT `mains`.* FROM `mains` WHERE `mains`.`id` = 1 LIMIT 1
UPDATE `mains` SET `email` = 'estudiuni.com', `about` = '<p>sobre</p>', `updated_at` = '2013-10-14 17:28:58' WHERE `mains`.`id` = 1