app/views/jobs/index.html.erb

SELECT COUNT(*) FROM `for_sale_items` WHERE `for_sale_items`.`designer_id` = 1
---

		<% if @designer.for_sale_items.count > 0 %>