app/views/jobs/show.html.erb

SELECT `job_images`.* FROM `job_images` WHERE `job_images`.`job_id` = 1 ORDER BY position ASC
---
		<% index = 1 %>
		<% @job.job_images.each do |image| %>

SELECT `designers`.* FROM `designers` INNER JOIN `designers_jobs` ON `designers`.`id` = `designers_jobs`.`designer_id` WHERE `designers_jobs`.`job_id` = 1 ORDER BY name ASC
---
	<ul id="artists">
	<% @job.designers.each do |designer| %>