app/views/home/index.html.erb

			<p>
				<%= job.name %><%= job.designers.blank? ? "" : " / " %>
				<% job.designers.each do |designer| %>
					<%= designer.name %> <%= (index < job.designers.count) ? " / " : "" %>
---
SELECT `designers`.* FROM `designers` INNER JOIN `designers_jobs` ON `designers`.`id` = `designers_jobs`.`designer_id` WHERE `designers_jobs`.`job_id` = 1 ORDER BY name ASC
SELECT COUNT(*) FROM `designers` INNER JOIN `designers_jobs` ON `designers`.`id` = `designers_jobs`.`designer_id` WHERE `designers_jobs`.`job_id` = 1