app/views/designers/show.html.erb

SELECT COUNT(*) FROM `for_sale_items` WHERE `for_sale_items`.`designer_id` = 1
---
				{ :controller => "jobs", :action => "index", :designer_id => @designer }%></li>
		<% if @designer.for_sale_items.count > 0 %>