app/views/admin/jobs/_form.html.erb

SELECT `designers`.* FROM `designers` ORDER BY name ASC
SELECT 1 AS one FROM `designers` INNER JOIN `designers_jobs` ON `designers`.`id` = `designers_jobs`.`designer_id` WHERE `designers_jobs`.`job_id` IS NULL AND `designers`.`id` = 7 ORDER BY name ASC LIMIT 1
---
		<%= f.label "Artistas" %>
		<% Designer.all.each do |designer| %>
		<div>
			<%= check_box_tag :artist_ids, designer.id, @job.designers.include?(designer), :name => "job[designer_ids][]" %>