app/controllers/contacts_controller.rb

  def index
    @designers = Designer.all
---
SELECT `designers`.* FROM `designers` ORDER BY name ASC