app/controllers/designers_controller.rb

SELECT `designers`.* FROM `designers` ORDER BY name ASC
---
  def index
    @designers = Designer.all