app/controllers/for_sale_items_controller.rb

SELECT `for_sale_items`.* FROM `for_sale_items` WHERE `for_sale_items`.`id` = 2 LIMIT 1
---
  def show
    @for_sale_item = ForSaleItem.find( params[:id] )