app/controllers/main_controller.rb

SELECT `mains`.* FROM `mains` LIMIT 1
---
  def about
    @estudiuni = Main.first

SELECT `mains`.* FROM `mains` LIMIT 1
---
  def jobs
    @estudiuni = Main.first